# Import Libraries & CSV

Lewis is stupid

sdfsfdfsdfsdf

In [1]:
!pip install pulp

Collecting pulp
  Downloading https://files.pythonhosted.org/packages/b5/87/71293d89377341551f2f331d259c0b7e7324b60ce37c597d0a42f0ebc18d/PuLP-1.6.8.tar.gz (13.5MB)
    100% |████████████████████████████████| 13.5MB 123kB/s ta 0:00:01
Requirement already satisfied: pyparsing>=2.0.1 in /anaconda3/lib/python3.6/site-packages (from pulp)
Building wheels for collected packages: pulp
  Running setup.py bdist_wheel for pulp ... done
  Stored in directory: /Users/juliekim/Library/Caches/pip/wheels/cd/1a/23/d1947610005912274e128267c5ed1bcc1fe6dece9f2d4d1c84
Successfully built pulp
Installing collected packages: pulp
Successfully installed pulp-1.6.8
You are using pip version 9.0.1, however version 18.1 is available.
You should consider upgrading via the 'pip install --upgrade pip' command.

fsdflwlek;kewr;kew

In [1]:
import pandas as pd

In [2]:
fuel_output = pd.read_csv('/Users/juliekim/Desktop/FYDP data/on_fuel_source_output_2017.csv', keep_default_na=False, na_values=[""])

In [3]:
fuel_demand = pd.read_csv('/Users/juliekim/Desktop/FYDP data/on_demand_2017.csv', keep_default_na=False, na_values=[""])

# Data Manipulation

In [4]:
fuel_output.head()

         Date  Hour     Fuel  Output
0  2017-01-01     1  NUCLEAR   11592
1  2017-01-01     1      GAS     234
2  2017-01-01     1    HYDRO    2455
3  2017-01-01     1     WIND    2433
4  2017-01-01     1    SOLAR       0

subtract 1 hour because we want 0 to 23 hr

gvggg

In [5]:
fuel_output['Hour'] = fuel_output['Hour'] - 1

In [6]:
fuel_output.head()

         Date  Hour     Fuel  Output
0  2017-01-01     0  NUCLEAR   11592
1  2017-01-01     0      GAS     234
2  2017-01-01     0    HYDRO    2455
3  2017-01-01     0     WIND    2433
4  2017-01-01     0    SOLAR       0

In [7]:
fuel_demand.head()

,Date,Hour,Ontario Demand,Northwest,Northeast,Ottawa,East,Toronto,Essa,Bruce,Southwest,Niagara,West,Zone Total,Diff
0,2017-01-01,1,13522,495,1476,1051,1203,5665,1045,72,2986,465,1334,15790,"2,268"
1,2017-01-01,2,13117,495,1476,1051,1203,5665,1045,72,2986,465,1334,15790,"2,673"
2,2017-01-01,3,12816,495,1476,1051,1203,5665,1045,72,2986,465,1334,15790,"2,974"
3,2017-01-01,4,12605,495,1476,1051,1203,5665,1045,72,2986,465,1334,15790,"3,186"
4,2017-01-01,5,12563,495,1476,1051,1203,5665,1045,72,2986,465,1334,15790,"3,227"

In [8]:
fuel_demand['Hour'] = fuel_demand['Hour'] -1

In [9]:
fuel_demand.head()

,Date,Hour,Ontario Demand,Northwest,Northeast,Ottawa,East,Toronto,Essa,Bruce,Southwest,Niagara,West,Zone Total,Diff
0,2017-01-01,0,13522,495,1476,1051,1203,5665,1045,72,2986,465,1334,15790,"2,268"
1,2017-01-01,1,13117,495,1476,1051,1203,5665,1045,72,2986,465,1334,15790,"2,673"
2,2017-01-01,2,12816,495,1476,1051,1203,5665,1045,72,2986,465,1334,15790,"2,974"
3,2017-01-01,3,12605,495,1476,1051,1203,5665,1045,72,2986,465,1334,15790,"3,186"
4,2017-01-01,4,12563,495,1476,1051,1203,5665,1045,72,2986,465,1334,15790,"3,227"

Create Datetime columns in both df

In [10]:
fuel_output['Datetime'] = pd.to_datetime(fuel_output['Date']) + pd.to_timedelta(fuel_output['Hour'], unit='h')

In [11]:
fuel_output.head()

         Date  Hour     Fuel  Output   Datetime
0  2017-01-01     0  NUCLEAR   11592 2017-01-01
1  2017-01-01     0      GAS     234 2017-01-01
2  2017-01-01     0    HYDRO    2455 2017-01-01
3  2017-01-01     0     WIND    2433 2017-01-01
4  2017-01-01     0    SOLAR       0 2017-01-01

In [12]:
fuel_demand['Datetime'] = pd.to_datetime(fuel_demand['Date']) + pd.to_timedelta(fuel_demand['Hour'], unit='h')

In [13]:
fuel_demand.head()

,Date,Hour,Ontario Demand,Northwest,Northeast,Ottawa,East,Toronto,Essa,Bruce,Southwest,Niagara,West,Zone Total,Diff,Datetime
0,2017-01-01,0,13522,495,1476,1051,1203,5665,1045,72,2986,465,1334,15790,"2,268",2017-01-01 00:00:00
1,2017-01-01,1,13117,495,1476,1051,1203,5665,1045,72,2986,465,1334,15790,"2,673",2017-01-01 01:00:00
2,2017-01-01,2,12816,495,1476,1051,1203,5665,1045,72,2986,465,1334,15790,"2,974",2017-01-01 02:00:00
3,2017-01-01,3,12605,495,1476,1051,1203,5665,1045,72,2986,465,1334,15790,"3,186",2017-01-01 03:00:00
4,2017-01-01,4,12563,495,1476,1051,1203,5665,1045,72,2986,465,1334,15790,"3,227",2017-01-01 04:00:00

Groupby Datetime

In [14]:
fuel_output_total = pd.DataFrame(fuel_output.groupby('Datetime')['Output'].sum())
fuel_output_total.columns = ['fuel_total']

In [15]:
fuel_output_total.head()

                     fuel_total
Datetime
2017-01-01 00:00:00       16715
2017-01-01 01:00:00       16344
2017-01-01 02:00:00       15942
2017-01-01 03:00:00       15727
2017-01-01 04:00:00       15653

Set index using Datetime

In [16]:
fuel_demand.set_index('Datetime',inplace=True)

In [17]:
fuel_demand.head()

,Date,Hour,Ontario Demand,Northwest,Northeast,Ottawa,East,Toronto,Essa,Bruce,Southwest,Niagara,West,Zone Total,Diff
Datetime,,,,,,,,,,,,,,,
2017-01-01 00:00:00,2017-01-01,0,13522,495,1476,1051,1203,5665,1045,72,2986,465,1334,15790,"2,268"
2017-01-01 01:00:00,2017-01-01,1,13117,495,1476,1051,1203,5665,1045,72,2986,465,1334,15790,"2,673"
2017-01-01 02:00:00,2017-01-01,2,12816,495,1476,1051,1203,5665,1045,72,2986,465,1334,15790,"2,974"
2017-01-01 03:00:00,2017-01-01,3,12605,495,1476,1051,1203,5665,1045,72,2986,465,1334,15790,"3,186"
2017-01-01 04:00:00,2017-01-01,4,12563,495,1476,1051,1203,5665,1045,72,2986,465,1334,15790,"3,227"

Create SBG data by joining the two data and taking the difference

In [18]:
SBG = pd.merge(fuel_output_total[['fuel_total']],fuel_demand[['Ontario Demand']], how='inner',left_index=True, right_index=True)

In [19]:
SBG.head()

                     fuel_total  Ontario Demand
Datetime
2017-01-01 00:00:00       16715           13522
2017-01-01 01:00:00       16344           13117
2017-01-01 02:00:00       15942           12816
2017-01-01 03:00:00       15727           12605
2017-01-01 04:00:00       15653           12563

In [20]:
SBG['Difference'] = SBG['fuel_total'] - SBG['Ontario Demand']

In [21]:
SBG.head()

                     fuel_total  Ontario Demand  Difference
Datetime
2017-01-01 00:00:00       16715           13522        3193
2017-01-01 01:00:00       16344           13117        3227
2017-01-01 02:00:00       15942           12816        3126
2017-01-01 03:00:00       15727           12605        3122
2017-01-01 04:00:00       15653           12563        3090

Check if there's any cell with difference less than 0

In [24]:
SBG[SBG['Difference']<0].count()

fuel_total        697
Ontario Demand    697
Difference        697
dtype: int64

Assign negative numbers with 0's

In [25]:
SBG.loc[SBG['Difference']<=0,'Difference'] = 0

In [26]:
SBG[SBG['Difference']<0].count()

fuel_total        0
Ontario Demand    0
Difference        0
dtype: int64

Export the SBG data to a csv file

In [27]:
SBG.to_csv('exportfile'+'.csv', index=True, sep=',')

# Linear Programming

In [2]:
from pulp import *

In [22]:
prob = LpProblem("Giapetto",LpMaximize)
print(prob)

#Linear programming variables 
x1 = LpVariable("x1", lowBound = 0)
x2 = LpVariable("x2", lowBound =0)

#Objective Function
prob += 20*x1 + 30*x2

#Constraint equations 
prob += 1*x1 + 2*x2 <= 100
prob += 2*x1 + 1*x2 <= 100
prob

Giapetto:
MAXIMIZE
None
VARIABLES

Giapetto:
MAXIMIZE
20*x1 + 30*x2 + 0
SUBJECT TO
_C1: x1 + 2 x2 <= 100

_C2: 2 x1 + x2 <= 100

VARIABLES
x1 Continuous
x2 Continuous

In [23]:
status = prob.solve()

In [24]:
LpStatus[status]

'Optimal'

In [25]:
value(x1), value(x2), value(prob.objective)

(33.333333, 33.333333, 1666.6666500000001)